# StructuralAnalyticalProjectMemberPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalProjectMemberPlane Property
ParameterTypeId Class See Also
---
"Vertical Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalProjectMemberPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalProjectMemberPlane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalProjectMemberPlane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace